In [13]:
import mysql.connector
from tabulate import tabulate
import pandas as pd
import math
import sys

## Connect to Remote Database
## Insert database information

HOST = "147.46.15.238"
PORT = ""
USER = "DS2024_0024"
PASSWD = "DS2024_0024"
DB = "DS_proj_12"

connection = mysql.connector.connect(
    host=HOST,
    port=7000,
    user=USER,
    passwd=PASSWD,
    db=DB,
    autocommit=True  # to create table permanently
)

cur = connection.cursor(dictionary=True)

## 수정할 필요 없는 함수입니다.
# DO NOT CHANGE INITIAL TABLES IN prj.sql
def get_dump(mysql_con, filename):
    '''
    connect to mysql server using mysql_connector
    load .sql file (filename) to get queries that create tables in an existing database (fma)
    '''
    query = ""
    try:
        with mysql_con.cursor() as cursor:
            for line in open(filename, 'r'):
                if line.strip():
                    line = line.strip()
                    if line[-1] == ";":
                        query += line
                        cursor.execute(query)
                        query = ""
                    else:
                        query += line

    except Warning as warn:
        print(warn)
        sys.exit()


def get_output(query):
    cur.execute(query)
    out = cur.fetchall()
    df = pd.DataFrame(out)
    return df

get_dump(connection, 'prj.sql')

In [30]:
query = 'SELECT item, count(user) AS count\
		 FROM ratings\
		 WHERE rating is not null\
		 GROUP BY item\
		 ORDER BY count DESC\
		 LIMIT 10'

get_output(query)

   item  count
0    28    226
1    22    212
2    54    201
3   203    194
4    59    194
5    38    189
6   232    187
7   101    181
8    83    174
9    51    172